package com.example.myhealth.uilayer.ui_layer.Searchitems

import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.Spacer
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.height
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.foundation.lazy.items
import androidx.compose.material.icons.Icons
import androidx.compose.material.icons.filled.Search
import androidx.compose.material3.Icon
import androidx.compose.material3.OutlinedTextField
import androidx.compose.material3.OutlinedTextFieldDefaults
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.runtime.getValue
import androidx.compose.runtime.mutableStateOf
import androidx.compose.runtime.remember
import androidx.compose.runtime.setValue
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color.Companion.Black
import androidx.compose.ui.graphics.Color.Companion.Blue
import androidx.compose.ui.graphics.Color.Companion.Gray
import androidx.compose.ui.graphics.Color.Companion.Transparent
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import androidx.navigation.NavController

@Composable
fun SearchItem(navController: NavController) {
    var searchQuery by remember { mutableStateOf("") }

    var allItems = listOf(
        "•চিনি এক চা চামচ (১৬)",
        "• মধু এক চা চামচ (২২)",
        "• গুড় এক চা চামচ (২৫)",
        "•সাদা চালের ভাত (১ কাপ ২০০-২৪২)",
        "• লাল চালের ভাত ১ কাপ (২১৮)",
        "• সাদা পাউরুটি ১ স্লাইস (৬৭-৯৬)",
        "• লাল পাউরুটি ১ স্লাইস (৬০-৮৯)",
        "• বান রুটি ১টি (১৫০)",
        "• সাদা আটার রুটি ১টি (৭২)",
        "• লাল আটার রুটি ১টি (৬০)",
        "•ফালুদা এক গ্লাস (৩০০)",
        "• ফলের কাস্টার্ড ১ কাপ (১৭২-২৩২)",
        "• ময়দা এক কাপ (৪৫৫)",
        "• সাদা আটা এক কাপ (৪০০)",
        "• লাল আটা এক কাপ (৩৫৬)",
        "• চালের আটা এক কাপ (৫৭৮)",
        "• নুডুলস সিদ্ধ এক কাপ (২২০)",
        "• নান রুটি ১টি (৩১২)",
        "• চালের রুটি ১টি (১০৫)",
        "•রুমালি রুটি ১টি (২০০)",
        "•রুমালি রুটি ঘি সহ ১টি (২৪৫)",
        "• তন্দুরি রুটি ১টি (১০২-১২০)",
        "• তন্দুরি রুটি ঘি সহ ১টি (২৪৭)",
        "• মুগ ডাল খিচুড়ি ৩/৪ কাপ (১৭৬-২১৫)",
        "• পোলাউ এক কাপ (২৫৮)",
        "• চিকেন বিরিয়ানি এক কাপ (৪১৮)",
        "• সবজি বিরিয়ানি এক কাপ (২২০)",
        "•খাসির বিরিয়ানি এক প্লেট (৪৭০)",
        "• ফ্রাইড রাইস এক কাপ (১২০-৩৯০)",
        "• চাওমেই এক প্লেট (১৮২০-২৪৩০)",
        "•দুধ এক কাপ (১৪৬)",
        "• লো ফ্যাট দুধ ১ কাপ/২৪০ মিলি (৯০)",
        "•কনডেন্সড মিল্ক ১/২ কাপ (৪৯০)",
        "•সয়া দুধ এক কাপ (৯০)",
        "• মসুর ডাল রান্না করা ১ কাপ (২২৬)",
        "•মুগ ডাল রান্না করা এক কাপ (১৫০)",
        "•বুটের ডাল রান্না করা ১ কাপ (১০৭)",
        "•মিক্সড সবজি সিদ্ধ ১ কাপ (৫০)",
        "•মিক্সড সবজি ভাজি ১ কাপ (১১০)",
        "•মিক্সড সবজির কোর্মা ১/২ কাপ (১৭৩)",
        "•মিক্সড সবজি (লাবড়া/কারী) ২০০ গ্রাম (১৯০)",
        "•সবজির কোফতা কারি ১০০ গ্রাম (১৪৭)",
        "•মিক্সড সবজি স্টার ফ্রাই ১ কাপ(২০৭)",
        "•লাল শাক ভাজি ১/২ কাপ (৫০)",
        "• পালং শাক সিদ্ধ ১ কাপ (৪১)",
        "•বেগুন ভর্তা ১০০ গ্রাম (৭০)",
        "•আলু ভর্তা ১০০ গ্রাম (১৫০)",
        "•ঢেরস ভাজি ১ কাপ (১৩০)",
        "•আলুর দম ১০০ গ্রাম (১০৫)",
        "•বেগুন ভাজি এক পিস (১১৪)",
        "•আলুর চিপস এক মুঠো (১৬০)",
        "•ফ্রেঞ্চ ফ্রাই ১০০ গ্রাম (২৯৪)",
        "• টোস্ট বিস্কিট ১টি মাঝারি আকারের (৮৮)",
        "• Digestive বিস্কিট ১টি (৭৪)",
        "• মেরী বিস্কিট ১টি (১৬-২৮)",
        "• নোনতা বিস্কিট একটি (৪০)",
        "• চানাচুর ২০ গ্রাম (১১০)",
        "• টমেটো সস ১ টেবিল চামচ (২৫)",
        "• জেলি ১ টেবিল চামচ (১১০)",
        "• জ্যাম ১ টেবিল চামচ (১০০)",
        "• হরলিক্স ১ টেবিল চামচ (২০)",
        "• চকলেট ওভালটিন ১ টেবিল চামচ (২০)",
        "• ওভালটিন এক টেবিল চামচ (২০)",
        "•  চা ১ চা চামচ চিনি ও দুধ সহ ১ কাপ (২৬)",
        "• চা চিনি ও দুধ ছাড়া এক কাপ (২)",
        "• কফি ১ চা চামচ চিনি ও দুধ সহ ১ কাপ (৩৭)",
        "• কফি চিনি ও দুধ ছাড়া ১ কাপ (২)",
        "• প্লেইন কেক এক টুকরা (২১৮)",
        "• ক্যাপসিকাম ১ টি (১৫)",
        "• ফ্রুট কেক ১ টুকরা (৩২০-৩৬৬)",
        " • চকলেট ১ এক টুকরা (২৩৫)",
        "• পেস্ট্রি ১ টুকরা (৩৩০-৪০০)",
        "•আইস ক্রিম ১ কাপ (২৬৭-৭২০)",
        "•কোমল পানীয় এক বোতল/ ক্যান (১৫০)",
        "•আপেলের জুস (চিনি ছাড়া) ১ গ্লাস (১১৭)",
        "•আঙ্গুরের জুস (চিনি ছাড়া) ১ গ্লাস (১৫৪)",
        "•কমলার জুস (চিনি ছাড়া) ১ গ্লাস (৯৫)",
        "• পেপের জুস (চিনি ছাড়া) ১ গ্লাস (১৪১)",
        "•মিক্সড সবজি ও ফলের জুস ১ গ্লাস (৭২)",
        "•লাচ্ছি (চিনি সহ) ১ গ্লাস (১০০-১৫০)", "• লাচ্ছি (চিনি সহ) ১ গ্লাস (১০০-১৫০)",
        " • চকলেট মিল্ক সেক ১ গ্লাস (৯০০)",
        "• ডাবের পানি এক গ্লাস (৫০)",
        "• বোরহানি এক গ্লাস (১০০)",
        "• লেবুর রস ১ টেবিল চামচ (৫)",
        "লাড্ডু একটি (২০০-২৫০)",
        " • রসগোল্লা একটি (১৫০)",
        " • চমচম একটি (১৭৫)",
        " • লালমোহন একটি (২৮৮)",
        " • ছানার সন্দেশ একটি (১২০)",
        "বালুসাই একটি (২৫০)",
        "• রসমালাই ৪ টি (২৫০)",
        " • জিলাপি বড় একটি (২০০)",
        " গাজরের হালুয়া চিনি সহ ১ বাটি (২৬০-৪০০)",
        " সুজির হালুয়া ৩০ গ্রাম/১ পিস ১০০",
        " বুটের হালুয়া/ বরফি এক পিস (১৫০-২০০)",
        " পায়েশ ১০০ গ্রাম(১৪১)",
        " • জর্দা ১/২ কাপ (২০০-৪০০)",
        " • পাটিসাপটা একটি (৩০০)",
        "• ভাপা পিঠা একটি (৬০০)",
        "•তেলের পিঠা (মালপোয়া) ১টি (৩২৫)",
        "• মিষ্টি দই আধা কাপ (২০০)",
        "• কিশমিশ ১/২ কাপ (২১০)",
        "• খেজুর একটি (২৩)",
        "• আপেল একটি (৯০)",
        "• সাগর কলা একটি (১১০)",
        "•পেয়ারা একটি (৫০)",
        "•আম এক কাপ (১০৭)",
        "• আঙ্গুর এক কাপ (৬২)",
        "• কালো জাম ১টি (৩-৪)",
        " • আনারস এক কাপ (৭৮)",
        " • নাশপাতি একটি (৮১)",
        " • কাঠাল এক কাপ (১৫৫)",
        " • তরমুজ এক কাপ (৪৬)",
        "• পেঁপে এক কাপ (৫৫)",
        "  • লিচু এক কাপ (১২৫)",
        " • শশা ১/২ কাপ (৪)",
        "• গাজর ১ কাপ (৫২)",
        "• টমেটো ১ টি (৩০)",
        " • লেটুস ৩ টি (৫)",
        "• কাঠ বাদাম ১ মুঠো (১৬৮)",
        "• পেস্তা বাদাম ১ মুঠো (১৮৮)",
        " • কাজু বাদাম ১ মুঠো (১৭৮)",
        " • চিনা বাদাম ১ মুঠো (১৭০)",
        " • পরোটা তেলে ভাজা ১টি (২৪৩-২৯০)",
        "• আলু পরোটা ১টি (৩০০)",
        "• লুচি একটি (১৪০)",
        " • নান রুটি মাখন সহ ১টি (৪২৪)",
        "• সয়াবিন তেল ১ টেবিল চামচ (১২০)",
        "• জলপাই তেল ১ টেবিল চামচ (১১৯)",
        "• ক্যানোলা তেল ১ টেবিল চামচ (১২৪)",
        "• সরষের তেল ১ টেবিল চামচ (৫৫)",
        "• ঘি ১ টেবিল চামচ (১১২)",
        " • রুমালি রুটি ঘি সহ ১টি (২৪৫)",
        "• তন্দুরি রুটি ঘি সহ ১টি (২৪৭)",
        "• মেয়নেইস ১ টেবিল চামচ (১১০)",
        "• লো ফ্যাট মেয়নেইস ১ টেবিল চামচ (৪৫)",
        "• পিনাট বাটার ১ টেবিল চামচ (৯৪)",
        "• মাখন ১ টেবিল চামচ (১০০)",
        "• মার্জারিন এক টেবিল চামচ ৬৮",
        "• বিফ বার্গার একটি (১১০-৬৬০)",
        " • চিকেন বার্গার একটি (২১০-৪৫০)",
        "• চিকেন স্যান্ডউইচ ১টি (২৭৫)",
        " • পিজ্জা ছোট আকারের (১৬৮০-২৩১০)",
        " • হট ডগ একটি (২৫০)",
        " •  চিকেন রোল একটি (২৩৫)",
        " • চিকেন শর্মা একটি (৪৭৫)",
        "•  ফুচকা একটি (৫০)",
        " •  চটপটি ১/২ কাপ (৫০০)",
        "•  পাপড় তেলে ভাজা একটি (৪৩)",
        "•  পাপড় গ্রিল্ড/ মাইক্রোওভেন একটি (৩০)",
        " •  নিমকি একটি (১৬৩)",
        "•  ক্রিম বিস্কিট একটি (৭০-১৪০)",
        " •  এনার্জি/গ্লুকোস বিস্কিট একটি (২৩-৩৩)",
        "•  পেয়াজু/ পাকোড়া ১টি (৬০-২১১)",
        " •  ডালপুরি একটি (১২৪)",
        " •  সিঙ্গারা একটি (২০০)",
        " •  সমসা ১টি (১০৩-২৫৬)",
        "•  আলুর চপ ১টি (১৫০-২৭৫)",
        " •  রুমালি রুটি ঘি সহ ১টি (২৪৫)",
        " •  তন্দুরি রুটি ঘি সহ ১টি (২৪৭)",
        " •  চিজ কেক ১ টুকরা (১৩৮০-১৬৭০)",
        " •  ঢাকাই পনির ২ টেবিল চামচ (৪০)",
        " •  মজারেলা পনির ১ কাপ (৩৩৬)",
        "• ডিম সিদ্ধ ১টি ৭৫(৬০ কুসুম +১৫ সাদা অংশ)",
        " • ডিম ভাজি একটি (৯২-১৭৫)",
        "• ডিম পোচ তেল ছাড়া ১টি (৮০)",
        "•ডিম পোচ তেল দিয়ে ১টি (২০২)",
        " • টিক্কা মুরগি ১০০ গ্রাম (১৪৮)",
        " • মুরগি ভুনা ১০০ গ্রাম/আধা কাপ (১৩২-৩২৩)",
        " •মুরগির কোর্মা ১০০ গ্রাম (২৫০)",
        " •চিকেন ফ্রাই একটি/১২৮ গ্রাম (৩৯০)",
        " •চিকেন কাটলেট ১টি (৩৭৫)",
        " •মাছ কারি ১০০ গ্রাম (৩২৩-৫০০)",
        " • চিংড়ি মাছ কারি ১০০ গ্রাম (২৬১)",
        " •মাছের কাটলেট একটি (২২৮)",
        " •ফিশ ফিঙ্গার তিনটি (১৬২)",
        " •গরু ভুনা এক কাপ (৪৩৪)",
        " •গরুর কোর্মা ১১৫ গ্রাম (১৬৭)",
        " • গরুর শিক কাবাব ১টি শিক (১৬০)",
        " •গরুর সামি কাবাব একটি (২১০)",
        " •গরুর কিমা রান্না করা ২৫০ গ্রাম/এক কাপ (৫৫৫)",
        "•গরুর কাটলেট একটি (৫০০)",
        "•খাসির কোর্মা ১১৪ গ্রাম (১৪৩)",
        "•খাসির রেজালা ১০০ গ্রাম ৩২৩",
        "•খাসির কিমা রান্না ১০০ গ্রাম (১৭৫)",
        "• গরুর কলিজা কারি ১০০ গ্রাম ১৩৫",
        "• মুরগির কলিজা কারি ১০০ গ্রাম ১ কাপ (৩৪০ -৩৫৩)",
        "• নারিকেলের বরফি ১টি (১৯২)",
        " • ক্যারামেল পুডিং ১/২ কাপ (১২০)",
        " • নারিকেলের বরফি ১টি (১৯২)",
        " • ক্যারামেল পুডিং ১/২ কাপ (১২০)",
        " • টক দই আধা কাপ (৬০)"
    )


    var filteredItems = allItems.filter { it.contains(searchQuery, ignoreCase = true) }

    Column(modifier = Modifier.padding(16.dp)) {
        OutlinedTextField(
            value = searchQuery,
            onValueChange = { searchQuery = it },
            label = { Text("Search...") },
            leadingIcon = { Icon(Icons.Default.Search, contentDescription = "Search Icon") },
            modifier = Modifier.fillMaxWidth(),
            colors = OutlinedTextFieldDefaults.colors(
                focusedTextColor = Blue,
                unfocusedContainerColor = Transparent,
                focusedContainerColor = Transparent,
                unfocusedTextColor = Gray
            )
        )

        Spacer(modifier = Modifier.height(10.dp))

        LazyColumn {
            items(filteredItems) { item ->
                Text(
                    text = item,
                    modifier = Modifier
                        .fillMaxWidth()
                        .padding(8.dp),
                    fontSize = 18.sp
                )
            }
        }
    }
}
