package com.example.myhealth.uilayer.ui_layer.DietInformation

import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.Spacer
import androidx.compose.foundation.layout.height
import androidx.compose.foundation.layout.padding
import androidx.compose.material3.MaterialTheme
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Modifier
import androidx.compose.ui.text.font.FontWeight
import androidx.compose.ui.tooling.preview.Preview
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import androidx.navigation.NavController

@Composable
fun Dietinfotext1(navController: NavController) {
    Column (modifier = Modifier.padding(5.dp)){
        Text(
            text = "বি.এম.আই (BMI) ও বি.এম.আর (BMR) কি?",
            fontSize = 25.sp,
            style = MaterialTheme.typography.bodyMedium
        )
        Spacer(modifier=Modifier.height(10.dp))
        Text(
            text = "বি.এম.আই (BMI)",
            fontSize = 20.sp,
            fontWeight = FontWeight.Bold
        )

        Text(
            text = "শরীরের ওজন কে উচ্চতার বর্গ দিয়ে ভাগ করে বডি ম্যাস ইনডেক্স (বিএমআই) হিসাব করা হয়। " +
                    "এটা আমাদের শরীর ঠিক আছে নাকি বোঝার জন্য খুব ভালো প্রক্রিয়া। কারন এর দ্বারা বোঝা যায় যে আপনার উচ্চতা অনুযায়ী আপনার ওজন ঠিক আছে কি নাই " +
                    "এবং আপনার স্বাভাবিক ওজনের পাল্লা কত সেইটাও বিএমআই এর মাধ্যমে জানা যায়।",
            fontSize = 15.sp
        )

        Spacer(modifier=Modifier.height(10.dp))

        Text(
            text = "বি.এম.আর (BMR)",
            fontSize = 20.sp,
            fontWeight = FontWeight.Bold
        )

        Text(
            text = "বেসাল মেটাবোলিক রেট বা বিএমআর দ্বারা আপনার শরীর সম্পূর্ণ বিশ্রাম অবস্থায় দৈনিক প্রয়োজনীয় ক্যালরির চাহিদা কত সেটি জানা যায়।",
            fontSize = 15.sp
        )

    }
}


@Composable
fun Dietinfotext2(navController: NavController) {
    Column(modifier = Modifier.padding(5.dp)) {
        Text(
            text = "সুস্থ্য জীবনের জন্য ১১ টি টিপস",
            fontSize = 25.sp,
            style = MaterialTheme.typography.bodyMedium
        )

        Text(
            text = "১. আপনি মোটা বা চিকন যেমনি হন না কেন প্রতিদিন অন্তত ৩০ মিনিট হাঁটুন। শরীর সুস্থ থাকলে ছুটির দিনেও হাঁটার অভ্যাস টি বাদ দিবেন না।\n" +
                    "২. সকালে ঘুম থেকে উঠেই প্রকৃতির নির্মল পরিবেশে থাকার চেষ্টা করুন এবং সারা দিনের করণীয় গুলো সম্পর্কে প্লানিং করুন।\n" +
                    "৩. নির্ভরযোগ্য প্রাকৃতিক উপাদানে ঘরে তৈরি খাবার বেশি খাবেন আর প্রক্রিয়াজাত খাবার কম খাবেন।\n" +
                    "৪. সবুজ চা এবং পর্যাপ্ত পানি পান করুন।\n" +
                    "৫. গালগল্প, অতীতের স্মৃতি, বাজে চিন্তা করে আপনার মূল্যবান সময় এবং শক্তি অপচয় করবেন না। ভাল কাজে সময় ও শক্তি ব্যয় করুন।\n" +
                    "৬. রাত ১০ টার মধ্যেই ঘুমানোর আর ভোরের সময় ঘুম থেকে ওঠার চেষ্টা করুন। দেখা গেছে পৃথিবীর বেশীরভাগ স্বাস্থ্যবান, রোগমুক্ত ও সফল মানুষ এই রুটিনেই ঘুমান এবং ঘুম থেকে ওঠেন।\n" +
                    "৭. জীবন সব সময় সমান যায় না, তবুও ভাল কিছুর অপেক্ষা করতে শিখুন। আজকে আপনি অনেক মোটা বা চিকন। কিন্তু আপনি চেষ্টা করলে আপনার কাঙ্ক্ষিত ওজনের ও স্বাস্থ্যের লক্ষ্যে অবশ্যই পৌছাতে পারবেন। তাই ধৈর্য্য হারাবেন না। সৃষ্টিকর্তার ওপর ভরসা রাখুন।\n" +
                    "৮. কঠিন করে কোন বিষয় ভাববেন না। সকল বিষয়ের সহজ সমাধান চিন্তা করুন। মনে রাখবেন সময় যতই ভাল বা খারাপ হোক তা বদলাবেই।\n" +
                    "৯. সব সময় চেষ্টা করুন যাতে দৈনন্দিন প্রয়োজনীয় কোন কাজে আপনার কোনো রকম অলসতা না করে। মোটা মানুষের মোটা হওয়ার অনেকটাই কারণ তারা অলস।\n"+
                    "১০. প্রতিদিন একই সময়ে সেই সময়ের খাদ্য গ্রহন করুন। যেমন সকালের খাবার ৮ টায় খেলে প্রতিদিন ৮ টাতেই খাবার খাওয়ার চেষ্টা করতে হবে। " +
                    "একদিনের ডায়েটের খাবারকে ৪/৫ ভাগে ভেঙে প্রয়োজন মত গ্যাপ রেখে খাবার তালিকা বানান। তাহলে ঘন ঘন ক্ষুধা লাগবেনা।\n"+
       " ১১. অ্যাপ টি নিয়মিত ব্যবহার করতে থাকুন। অবশ্যই আপনি আপনার ওজন নিয়ন্ত্রণ করে সুস্থ্য থাকার লক্ষ্যে পৌছাতে পারবেন।",
            fontSize = 15.sp
        )
    }
}


@Composable
fun Dietinfotext3(navController: NavController) {
    Column(modifier = Modifier.padding(5.dp)) {
        Text(
            text = "লো-কার্ব ডায়েট কি? কেন করে?",
            fontSize = 25.sp,
            style = MaterialTheme.typography.bodyMedium
        )

        Text(
            text = "লো-কার্ব ডায়েট কিঃ এই ডায়েটে কার্ব (কার্বহাইড্রেট বা শর্করা জাতীয় খাবার) খুবই সীমিত থাকে। অন্যদিকে প্রোটিন, ফ্যাট ও শাকসবজিতে প্রাধান্য অনেক বেশী থাকে। গবেষণায় দেখা গেছে লো-কার্ব ডায়েট স্বাস্থ্যসম্মত এবং ওজন কমাতে খুবই কার্যকরী। অন্যান্য ডায়েটের তুলনায় লো-কার্ব দুই থেকে তিন গুণ বেশি কার্যকরী। এর তেমন পার্শ্ব-প্রতিক্রিয়া নেই। যে কোন সুস্থ মানুষ লো-কার্ব করতে পারবে। এমনকি অনেক ঝুঁকি পূর্ণ রোগের থাকলেও লো-কার্ব ডায়েট করা যায়। যেমনঃ পিসিওএস, থাইরয়েড, ডায়াবেটস এর রোগীরা এই ডায়েট করতে পারেন।\n" +
                    "লো-কার্ব যেভাবে কাজ করেঃ\n" +
                    "প্রধানত দুই ভাবে এই ডায়েট করে ওজন কমে।\n" +
                    "১. আমাদের শরীরে ইনসুলিন নামক একটি হরমোন আছে যার\n" +
                    "কাজ হচ্ছে শরীরে রক্তের গ্লুকোজ মাত্রা নিয়ন্ত্রণ করা। কার্ব কম খাওয়ার কারণে ইনসুলিন মাত্রা কমে যায়। ফলে কিডনি শরীরের অতিরিক্ত সোডিয়াম স্খলন করে ও ওজন কমাতে সাহায্য করে।\n" +
                    "২. আমাদের শরীর গ্লাইকোজেন আকারে কার্য জমিয়ে শরীরের মাসল ও লিভারের পানি বেধে রাখে। লো-কার্ব ডায়েট যখন আমরা কার্ব কম খাই তখন গ্লাইকোজেন কমে যায় তাই পানিও কমে যায় এবং ওয়াটার ওয়েট হ্রাস পায়।\n" +
                    "এই ডায়েটে খেতে হবেঃ মাছ, মাংস, ডিম, শাক সবজি, বাদাম, ফল, হাই-ফ্যাট দুগ্ধজাতীয় খাবার যেমন চীজ, বাটার। অলিভওয়েল, ঘি, কোকনাট ওয়েল।\n" +
                    "যেগুলো খাওয়া যাবেনাঃ চিনি, হাই গ্লাইসেমিক ইনডেক্সড ফুড, প্রোসেসড ফুডস (যেমন সফট ড্রিঙ্কস বা কোমল পানীয়)।\n" +
                    "টোটাল ফ্যাট % যেন মিল প্ল্যানের ৪৫-৫০% থেকে বেশি না হয় সেদিকে খেয়াল রাখবেন।\n" +
                    "ম্যাক্রো রেশিও বা পুষ্টির অনুপাতঃ\n" +
                    "কার্বঃ 25%\n" +
                    "প্রোটিনঃ 25%\n" +
                    "ফ্যাটঃ 50%",
            fontSize = 15.sp
        )
    }
}

